[
  {
    "id": 1,
    "name": "2021 Honda Passport",
    "description": "The Honda Passport ranks in the top half of our midsize SUV rankings. Its well-rounded performance and spacious cabin are highly appealing, but it’s held back by finicky infotainment controls.",
    "seat": 5,
    "milageCity": "19-20",
    "milageHighway": "24-25",
    "driveTrain": "FWD, AWD",
    "horsepower": 280,
    "rating": 4.1,
    "price": "32,790",
    "whyBuy": "Roomy and comfortable, the Honda Passport is an impressive SUV, but there are plenty of great options in the class. If you want an even better off-roader, consider the Jeep Grand Cherokee. You might also be interested in the Honda Pilot, which is essentially a three-row version of the Passport.",
    "img": "https://cars.usnews.com/pics/size/776x517/images/Auto/izmo/i159614165/2021_honda_passport_angularfront.jpg",
    "img1": "https://cars.usnews.com/pics/size/776x517/images/Auto/izmo/i159614165/2021_honda_passport_angularrear.jpg"
  },
  {
    "id": 2,
    "name": "2021 Kia Sorento",
    "description": "The fully redesigned 2021 Kia Sorento cracks the top half of our midsize SUV rankings. It’s enjoyable to drive, and it offers a quality interior and user-friendly tech features.",
    "seat": "6-7",
    "milageCity": "21-24",
    "milageHighway": "25-29",
    "driveTrain": "FWD, AWD",
    "horsepower": "191 - 281",
    "rating": 4,
    "price": "29,390",
    "whyBuy": "You should strongly consider the Sorento if you're looking for a midsize SUV or any kind of smaller crossover vehicle. Not only does it boast all the great attributes discussed above, it costs less than many of its classmates, making it a strong value.",
    "img": "https://dealerimages.dealereprocess.com/image/upload/c_limit,f_auto,fl_lossy,w_auto/v1/svp/dep/21kiasorentoex/kia_21sorentoex_angularfront_sparklingsilver",
    "img1": "https://i.ibb.co/b3RjTGx/image.png"
  },
  {
    "id": 3,
    "name": "2021 Honda CR-V",
    "description": "Impressive passenger and cargo space, a refined cabin, and a lively, efficient turbocharged engine help the 2021 Honda CR-V vault toward the top of our compact SUV rankings.",
    "seat": 5,
    "milageCity": "27-28",
    "milageHighway": "32-34",
    "driveTrain": "FWD, AWD, AWD",
    "horsepower": 190,
    "rating": 4.4,
    "price": "25,350",
    "whyBuy": "The CR-V should be on the shortlist of anyone looking for a crossover SUV. The base model is a decent value proposition thanks to its hefty number of standard driver-assist features, but techies will need to spend an extra couple thousand for amenities such as Android Auto and Apple CarPlay. The CR-V checks nearly every box, but it’s not very athletic. If you’re seeking a small SUV with agile handling, you’ll want to check out the Mazda CX-5.",
    "img": "https://i.ibb.co/YBH7gqT/image.png",
    "img1": "https://i.ibb.co/ZBmLhsf/image.png"
  },
  {
    "id": 4,
    "name": "2021 Toyota RAV4 Hybrid",
    "description": "The well-rounded Toyota RAV4 Hybrid earns a spot near the top of our hybrid and electric SUV rankings. Its refined performance, impressive fuel economy, and high-end interior all give this crossover a leg up on other hybrids.",
    "seat": 5,
    "milageCity": "",
    "milageHighway": "",
    "driveTrain": "AWD",
    "horsepower": "176-219",
    "rating": 4.1,
    "price": "28,500",
    "whyBuy": "The Toyota RAV4 Hybrid has just about everything you could want in a small SUV. It’s roomy, fuel-efficient, powerful, and well-equipped. If you like this vehicle, you might also be interested in its Toyota siblings, the gas-only RAV4 and, all-new for 2021, the plug-in RAV4 Prime.",
    "img": "https://dealerimages.dealereprocess.com/image/upload/c_limit,f_auto,fl_lossy,w_600/v1/svp/dep/20toyotarav4xsehyawdsu5t/toyota_20rav4xsehyawdsu5t_angularfront_blizzardpearlmidnightblackmetallic",
    "img1": "https://i.ibb.co/Nnw5LWg/image.png"
  },
  {
    "id": 5,
    "name": "2021 Honda Odyssey",
    "description": "The 2021 Honda Odyssey earns a spot near the top of our minivan rankings thanks to its spacious and well-appointed interior, lively performance, and abundance of family-friendly technology.",
    "seat": "7-8",
    "milageCity": "19",
    "milageHighway": "28",
    "driveTrain": "FWD",
    "horsepower": 280,
    "rating": 4.5,
    "price": "31,790",
    "whyBuy": "Anyone set on buying a minivan should have the Odyssey on their shortlist. Though it has one of the highest retail prices in the class, this Honda gives you a lot for your money. Its value proposition is enhanced for 2021 with the addition of numerous standard active safety features, such as pedestrian detection, automatic emergency braking, and lane keep assist.",
    "img": "https://i.ibb.co/QFcK0GX/image.png",
    "img1": "https://i.ibb.co/c3CddFj/image.png"
  },
  {
    "id": 6,
    "name": "2021 Toyota Camry",
    "description": "The 2021 Toyota Camry sits near the top of our midsize car rankings. It boasts a generous list of standard safety tech, straightforward infotainment controls, a gentle ride, sharp steering, and a potent engine option.",
    "seat": 5,
    "milageCity": "22-28",
    "milageHighway": "31-39",
    "driveTrain": "FWD, AWD",
    "horsepower": "203 - 301",
    "rating": 4.3,
    "price": "25,045",
    "whyBuy": "The Toyota Camry merits a spot on the shortlist of any midsize-sedan shopper. However, it’s not the only well-rounded vehicle in the class. The Honda Accord exhibits lithe handling and features a larger trunk than the Camry, while the Mazda6 has an upscale cabin and rivals the Toyota’s agility. If you like the Toyota but want something more fuel-efficient, consider the Camry Hybrid, which we review separately",
    "img": "https://images.hgmsites.net/med/2022-toyota-camry-se-auto-natl-angular-front-exterior-view_100806216_m.jpg",
    "img1": "https://i.ibb.co/q0p9BpB/image.png"
  },
  {
    "id": 7,
    "name": "2021 Hyundai Accent",
    "description": "The 2021 Hyundai Accent offers plenty of passenger space and a user-friendly, though basic, infotainment system, but this small sedan can be slow to accelerate, and it's not as engaging to drive as some rivals.",
    "seat": 5,
    "milageCity": "29-33",
    "milageHighway": "39-41",
    "driveTrain": "FWD",
    "horsepower": 120,
    "rating": 3.8,
    "price": "15,395",
    "whyBuy": "The Accent is a good choice if you’re looking for a daily driver that can regularly carry up to four adults comfortably but is also small enough to fit into tight parking spaces on city streets. However, you should look elsewhere if you prioritize an engaging performance or cargo space. Competitors worth considering include the more athletic Kia Rio and larger Hyundai Elantra.",
    "img": "https://i.ibb.co/9YwZYT7/image.png",
    "img1": "https://i.ibb.co/4KqRrFJ/image.png"
  },
  {
    "id": 8,
    "name": "2022 Audi A4",
    "description": "The 2022 Audi A4 has peppy engine performance, balanced driving dynamics, a posh cabin, and an easy-to-use infotainment system. Trunk space is average at best though.",
    "seat": 5,
    "milageCity": "20-25 ",
    "milageHighway": "28-34",
    "driveTrain": "AWD",
    "horsepower": "201 - 349",
    "rating": 4.3,
    "price": "39,900",
    "whyBuy": "The 2022 Audi A4 is a must-see if you're shopping for a luxury sedan. It's refined, practical, and a pretty good value. Prices start at just over $39,000. That said, this segment is loaded with fine options, like the BMW 3 Series, Mercedes-Benz C-Class, Volvo S60, and Genesis G70. You may want to give those models a look, too.",
    "img": "https://inv.assets.sincrod.com/ChromeColorMatch/us/WHITE_cc_2022AUC010004_01_1280_2Y2Y.jpg",
    "img1": "https://i.ibb.co/fHvfqxt/image.png"
  },
  {
    "id": 9,
    "name": "2021 Mazda",
    "description": "The 2021 Mazda6’s engaging ride and high-end cabin help it land near the top of our midsize car rankings.",
    "seat": 5,
    "milageCity": "23-26",
    "milageHighway": "31-35",
    "driveTrain": "FWD",
    "horsepower": "187 - 227",
    "rating": 4.2,
    "price": "24,475",
    "whyBuy": "If you’re looking for a fun-to-drive midsize car, it’s hard to beat the Mazda6. That said, there are a few other vehicles worth considering before you make your purchase decision. The Toyota Camry is nearly as fun to drive as the Mazda, and it's available with a very strong V6 engine option. The Honda Accord isn't as athletic as the Mazda, but it offers more passenger space and additional cargo room.",
    "img": "https://i.ibb.co/nQ9CF6G/image.png",
    "img1": "https://i.ibb.co/71J3sNz/image.png"
  },
  {
    "id": 10,
    "name": "2022 Chrysler 300",
    "description": "The 2022 Chrysler 300 has powerful engines and an interior that’s upscale and spacious. It’s not as modern as some competitors, however.",
    "seat": 5,
    "milageCity": "16-19",
    "milageHighway": "25-30",
    "driveTrain": "RWD, AWD",
    "horsepower": "292-363",
    "rating": 4,
    "price": "31,770",
    "whyBuy": "The 300 is big, comfortable, and easy to drive, so it should appeal to a lot of large sedan shoppers. It costs less than some of its classmates, which also makes it a solid value.",
    "img": "https://s.aolcdn.com/commerce/autodata/images/USD10CRC131A021001.jpg",
    "img1": "https://i.ibb.co/vs8ZjH8/image.png"
  },
  {
    "id": 11,
    "name": "2021 Mercedes-Benz S-Class",
    "description": "The 2021 Mercedes-Benz S-Class sedan ranks at the top of the super luxury car class, thanks to its spacious interior, exceptional materials, wealth of tech and safety features, refined powertrain, and relaxing ride quality.",
    "seat": 5,
    "milageCity": "14-16",
    "milageHighway": "24-26",
    "driveTrain": "AWD, RWD, AWD",
    "horsepower": "429-603",
    "rating": 4.8,
    "price": "109,800",
    "whyBuy": "You should consider the 2021 Mercedes-Benz S-Class if you're shopping for a super luxury car. The new S-Class sedan demonstrates just how indulgent, refined, and technologically advanced a luxury car can be. The only real issue is its price. At roughly $110,000 and up, the S-Class will be out of reach for many budgets. If that's the case, you may want to check out less expensive alternatives like the Audi A8, BMW 7 Series, and Mercedes' own CLS.",
    "img": "https://i.ibb.co/xmzGLkZ/image.png",
    "img1": "https://i.ibb.co/Pz0wpM0/image.png"
  },
  {
    "id": 12,
    "name": "2021 Genesis G90",
    "description": "The 2021 Genesis G90 has solid driving dynamics and a refined, spacious cabin. It also rates well for safety and includes intuitive in-car technology.",
    "seat": 5,
    "milageCity": "16-17",
    "milageHighway": "23-24",
    "driveTrain": "RWD, AWD",
    "horsepower": "365-420",
    "rating": 4.3,
    "price": "72,950",
    "whyBuy": "The 2021 G90 has a higher base price than all other class rivals, but a vast list of standard features actually makes it somewhat of a value. You'll be hard-pressed to find a more well-rounded luxury sedan at this price point.",
    "img": "https://images.dealer.com/ddc/vehicles/2021/Genesis/G90/Sedan/trim_33T_Premium_200a3b/color/Adriatic%20Blue-RY5-16%2C34%2C48-640-en_US.jpg",
    "img1": "https://i.ibb.co/BjPQD4s/image.png"
  }
]
