[
  {
    "id": 1,
    "name": "2021 Honda Passport",
    "description": "The Honda Passport ranks in the top half of our midsize SUV rankings. Its well-rounded performance and spacious cabin are highly appealing, but it’s held back by finicky infotainment controls.",
    "seat": 5,
    "milageCity": "19-20",
    "milageHighway": "24-25",
    "driveTrain": "FWD, AWD",
    "horsepower": 280,
    "rating": 4.1,
    "price": "32,790",
    "whyBuy": "Roomy and comfortable, the Honda Passport is an impressive SUV, but there are plenty of great options in the class. If you want an even better off-roader, consider the Jeep Grand Cherokee. You might also be interested in the Honda Pilot, which is essentially a three-row version of the Passport.",
    "img": "https://cars.usnews.com/pics/size/776x517/images/Auto/izmo/i159614165/2021_honda_passport_angularfront.jpg",
    "img1": "https://cars.usnews.com/pics/size/776x517/images/Auto/izmo/i159614165/2021_honda_passport_angularrear.jpg"
  },
  {
    "id": 2,
    "name": "2021 Kia Sorento",
    "description": "The fully redesigned 2021 Kia Sorento cracks the top half of our midsize SUV rankings. It’s enjoyable to drive, and it offers a quality interior and user-friendly tech features.",
    "seat": "6-7",
    "milageCity": "21-24",
    "milageHighway": "25-29",
    "driveTrain": "FWD, AWD",
    "horsepower": "191 - 281",
    "rating": 4,
    "price": "29,390",
    "whyBuy": "You should strongly consider the Sorento if you're looking for a midsize SUV or any kind of smaller crossover vehicle. Not only does it boast all the great attributes discussed above, it costs less than many of its classmates, making it a strong value.",
    "img": "https://dealerimages.dealereprocess.com/image/upload/c_limit,f_auto,fl_lossy,w_auto/v1/svp/dep/21kiasorentoex/kia_21sorentoex_angularfront_sparklingsilver",
    "img1": "https://i.ibb.co/b3RjTGx/image.png"
  },
  {
    "id": 3,
    "name": "2021 Honda CR-V",
    "description": "Impressive passenger and cargo space, a refined cabin, and a lively, efficient turbocharged engine help the 2021 Honda CR-V vault toward the top of our compact SUV rankings.",
    "seat": 5,
    "milageCity": "27-28",
    "milageHighway": "32-34",
    "driveTrain": "FWD, AWD, AWD",
    "horsepower": 190,
    "rating": 4.4,
    "price": "25,350",
    "whyBuy": "The CR-V should be on the shortlist of anyone looking for a crossover SUV. The base model is a decent value proposition thanks to its hefty number of standard driver-assist features, but techies will need to spend an extra couple thousand for amenities such as Android Auto and Apple CarPlay. The CR-V checks nearly every box, but it’s not very athletic. If you’re seeking a small SUV with agile handling, you’ll want to check out the Mazda CX-5.",
    "img": "https://i.ibb.co/YBH7gqT/image.png",
    "img1": "https://i.ibb.co/ZBmLhsf/image.png"
  },
  {
    "id": 4,
    "name": "2021 Toyota RAV4 Hybrid",
    "description": "The well-rounded Toyota RAV4 Hybrid earns a spot near the top of our hybrid and electric SUV rankings. Its refined performance, impressive fuel economy, and high-end interior all give this crossover a leg up on other hybrids.",
    "seat": 5,
    "milageCity": "",
    "milageHighway": "",
    "driveTrain": "AWD",
    "horsepower": "176-219",
    "rating": 4.1,
    "price": "28,500",
    "whyBuy": "The Toyota RAV4 Hybrid has just about everything you could want in a small SUV. It’s roomy, fuel-efficient, powerful, and well-equipped. If you like this vehicle, you might also be interested in its Toyota siblings, the gas-only RAV4 and, all-new for 2021, the plug-in RAV4 Prime.",
    "img": "https://dealerimages.dealereprocess.com/image/upload/c_limit,f_auto,fl_lossy,w_600/v1/svp/dep/20toyotarav4xsehyawdsu5t/toyota_20rav4xsehyawdsu5t_angularfront_blizzardpearlmidnightblackmetallic",
    "img1": "https://i.ibb.co/Nnw5LWg/image.png"
  },
  {
    "id": 5,
    "name": "2021 Honda Odyssey",
    "description": "The 2021 Honda Odyssey earns a spot near the top of our minivan rankings thanks to its spacious and well-appointed interior, lively performance, and abundance of family-friendly technology.",
    "seat": "7-8",
    "milageCity": "19",
    "milageHighway": "28",
    "driveTrain": "FWD",
    "horsepower": 280,
    "rating": 4.5,
    "price": "31,790",
    "whyBuy": "Anyone set on buying a minivan should have the Odyssey on their shortlist. Though it has one of the highest retail prices in the class, this Honda gives you a lot for your money. Its value proposition is enhanced for 2021 with the addition of numerous standard active safety features, such as pedestrian detection, automatic emergency braking, and lane keep assist.",
    "img": "https://i.ibb.co/QFcK0GX/image.png",
    "img1": "https://i.ibb.co/c3CddFj/image.png"
  },
  {
    "id": 6,
    "name": "2021 Toyota Camry",
    "description": "The 2021 Toyota Camry sits near the top of our midsize car rankings. It boasts a generous list of standard safety tech, straightforward infotainment controls, a gentle ride, sharp steering, and a potent engine option.",
    "seat": 5,
    "milageCity": "22-28",
    "milageHighway": "31-39",
    "driveTrain": "FWD, AWD",
    "horsepower": "203 - 301",
    "rating": 4.3,
    "price": "25,045",
    "whyBuy": "The Toyota Camry merits a spot on the shortlist of any midsize-sedan shopper. However, it’s not the only well-rounded vehicle in the class. The Honda Accord exhibits lithe handling and features a larger trunk than the Camry, while the Mazda6 has an upscale cabin and rivals the Toyota’s agility. If you like the Toyota but want something more fuel-efficient, consider the Camry Hybrid, which we review separately",
    "img": "https://images.hgmsites.net/med/2022-toyota-camry-se-auto-natl-angular-front-exterior-view_100806216_m.jpg",
    "img1": "https://i.ibb.co/q0p9BpB/image.png"
  }
]  